graphe frontend MAJ
